# HOTEL HR PEOPLE ANALYTICS

### Hotel Analysis from a People Analytics perspective.
<p>This project will try to emulate HR analytics to continue practicing my analytical skills. Also, with this project, I want to <u>strengthen my knowledge</u> in <b><i>MySql</b></i> <b><i>and SQL</i></b>. I will use <b><i>Python</i></b> and <b><i>Power BI</i></b> for the data analysis.</p>
<p>I will start with doing a little of data engineering to design the databases I am going to work with. I will use <b><i>Figma</i></b> to draft the databases and the relationships between each other. Then I will fill the databases with the data, and later I will start the data analysis.</p>

### 1. Import libraries

In [1]:
# Libraries to manipulate the data
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import random
import string

# Library to deploy charts with the data
import seaborn as sns
import matplotlib.pyplot as plt

# Statmodels for predictions
import statsmodels.api as sm
import statsmodels.formula.api as smf

# This is to ignore warnings.
import warnings
warnings.filterwarnings('ignore')

### 2. Creating the data bases

<p>Let's create the databases acording to the <u>draft</u> I have created in <b><i>Figma</b></i>.</p>

<p>The first database I will create is the Employee's database, because it is the one that will connect most of the other databases.</p>

In [2]:
# Employee's database
emp_schema = {'emp_id':'str', 'Name':'str', 'Surname':'str', 'Birthday':'object', 'Age':'int64', 'Gender':'str', 'on_license':'bool','hotel_id':'str'}
emp_df = pd.DataFrame(columns=emp_schema.keys()).astype(emp_schema)

print(emp_df)
emp_df.dtypes

Empty DataFrame
Columns: [emp_id, Name, Surname, Birthday, Age, Gender, on_license, hotel_id]
Index: []

emp_id        object
Name          object
Surname       object
Birthday      object
Age            int64
Gender        object
on_license      bool
hotel_id      object
dtype: object

In [3]:
# Let's create an add the data to our database
names = [
    "James", "John", "Robert", "Michael", "William", "David", "Richard", "Joseph", "Charles", "Thomas", 
    "Christopher", "Daniel", "Matthew", "Anthony", "Mark", "Donald", "Steven", "Paul", "Andrew", "Joshua", 
    "Kenneth", "Kevin", "Brian", "George", "Edward", "Ronald", "Timothy", "Jason", "Jeffrey", "Ryan", 
    "Jacob", "Gary", "Nicholas", "Eric", "Stephen", "Jonathan", "Larry", "Justin","Scott", "Brandon",  
    "Benjamin", "Samuel", "Gregory", "Frank", "Alexander", "Raymond", "Patrick", "Jack", "Dennis", "Jerry",
    "Tyler", "Aaron", "Jose", "Henry", "Adam", "Douglas", "Nathan", "Peter", "Zachary", "Kyle", 
    "Walter", "Harold", "Jeremy", "Ethan", "Carl", "Keith", "Roger", "Gerald", "Christian", "Terry", 
    "Sean", "Arthur", "Austin", "Noah", "Jesse", "Joe", "Albert", "Bryan", "Billy", "Bruce", 
    "Willie", "Jordan", "Dylan", "Alan", "Ralph", "Gabriel", "Roy", "Juan", "Wayne", "Eugene", 
    "Logan", "Randy", "Louis", "Russell", "Vincent", 
    "Mary", "Patricia", "Jennifer", "Linda", "Elizabeth", "Barbara", "Susan", "Jessica", "Sarah", "Karen", 
    "Nancy", "Margaret", "Lisa", "Betty", "Dorothy", "Sandra", "Ashley", "Kimberly", "Donna", "Emily", 
    "Michelle", "Carol", "Amanda", "Melissa", "Deborah", "Stephanie", "Rebecca", "Sharon", "Laura", "Cynthia", 
    "Kathleen", "Amy", "Shirley", "Angela", "Helen", "Anna", "Brenda", "Pamela", "Nicole", "Emma", 
    "Samantha", "Katherine", "Christine", "Debra", "Rachel", "Catherine", "Carolyn", "Janet", "Ruth", "Maria", 
    "Heather", "Diane", "Virginia", "Julie", "Joyce", "Victoria", "Olivia", "Kelly", "Christina", "Lauren", 
    "Joan", "Evelyn", "Judith", "Megan", "Cheryl", "Andrea", "Hannah", "Martha", "Jacqueline", "Frances", 
    "Gloria", "Mark", "Donald", "Steven", "Paul", "Andrew", "Joshua", "Frank", "Alexander", "Raymond", "Patrick", "Jack", "Dennis",  "Jerry", 
    "Tyler", "Aaron", "Jose", "Henry", "Adam", "Douglas", "Nathan", 
    "Kenneth", "Kevin", "Brian", "George", "Edward", "Ronald", "Timothy", "Jason", "Jeffrey", "Ryan", 
    "Jacob", "Gary", "Nicholas", "Eric", "Stephen", "Jonathan", "Larry", "Justin", "Scott", "Brandon", 
    "Benjamin", "Samuel", "Gregory", "Willie", "Jordan", "Dylan", "Alan", "Ralph", "Gabriel", "Roy", "Juan", "Wayne", "Eugene", 
    "Logan", "Randy", "Ethan", "Carl", "Keith", "Roger", "Gerald", "Christian", "Terry", 
    "Sean", "Arthur", "Austin", "Noah", "Jesse",
    "James", "John", "Robert", "Michael", "William", "David", "Richard", "Joseph", "Charles", "Thomas", 
    "Christopher", "Daniel", "Matthew", "Anthony","Peter", "Zachary", "Kyle", 
    "Walter", "Harold", "Jeremy",  "Joe", "Albert", "Bryan", "Billy", "Bruce", "Elizabeth", "Barbara", "Susan", "Jessica", "Sarah", "Karen", 
    "Nancy", "Margaret", "Judith", "Megan", "Cheryl", "Andrea", "Hannah", "Martha", "Jacqueline", "Frances", 
    "Gloria", "Ann", "Teresa", "Clarisa", "Dolores", "Ingrid", "Fernanda", "Costanza", "Louisa", "Virginia", 
    "Julia", "Jennifer", "Lisa", "Betty", "Dorothy", "Sandra", "Ashley", "Kimberly", "Donna", "Emily", 
    "Michelle", "Carol", "Amanda", "Melissa", "Deborah", "Stephanie", "Rebecca", "Sharon", "Laura", "Cynthia", 
    "Kathleen", "Amy", "Virginia", "Julie", "Joyce", "Victoria", "Olivia", "Kelly", "Christina", "Lauren", 
    "Joan", "Evelyn", "Shirley", "Angela", "Helen", "Anna", "Brenda", "Pamela", "Nicole", "Emma", 
    "Samantha", "Katherine", "Christine", "Debra", "Rachel", "Catherine", "Carolyn", "Janet", "Ruth", "Maria", 
    "Heather", "Diane", "Mary", "Patricia", "Jennifer", "Linda", "Walter", "Harold", "Jeremy", "Ethan", "Carl", "Keith", "Roger", "Gerald", "Christian", "Terry", 
    "Sean", "Arthur", "Austin", "Noah", "Jesse", "Joe", "Albert", "Bryan", "Billy", "Bruce","James", "John", "Robert", "Michael", "William", "David", "Richard", "Joseph", "Charles", "Thomas", "Jonathan", "Larry", "Justin", "Scott", "Brandon", 
    "Benjamin", "Samuel", "Gregory", "Frank", "Alexander", "Henry", "Adam", "Douglas", "Nathan", "Peter", "Zachary", "Kyle", 
    "Christopher", "Daniel", "Matthew", "Anthony", "Mark", "Donald", "Steven", "Paul", "Andrew", "Joshua", 
    "Kenneth", "Timothy", "Jason", "Jeffrey", "Ryan", 
    "Jacob", "Gary", "Nicholas", "Eric", "Stephen",  "Raymond", "Patrick", "Jack", "Dennis",  "Jerry", 
    "Tyler", "Aaron", "Jose",  "Kevin", "Brian", "George", "Edward", "Ronald", "Ann", "Teresa", "Clarisa", "Dolores", "Ingrid", "Mary", "Patricia", "Jennifer", "Linda", "Elizabeth", "Barbara", "Susan", "Jessica", "Sarah", "Karen",  "Shirley", "Angela", "Helen", "Anna", "Brenda", "Pamela", "Nicole", "Emma", 
    "Samantha", "Katherine", "Christine", "Olivia", "Kelly", "Christina", "Lauren", 
    "Joan", "Evelyn", "Judith", "Megan", "Cheryl", "Andrea", "Hannah", "Diane", "Virginia", "Julie", "Joyce", "Victoria",  "Martha",
    "Nancy", "Margaret", "Lisa", "Betty", "Dorothy", "Sandra", "Ashley", "Kimberly", "Donna", "Emily", 
    "Michelle", "Carol", "Amanda", "Melissa", "Deborah", "Stephanie", "Rebecca", "Sharon", "Laura", "Cynthia", 
    "Kathleen", "Amy", "Debra", "Rachel", "Catherine", "Carolyn", "Janet", "Ruth", "Maria", 
    "Heather",  "Jacqueline", "Frances",  "Julia", "Jennifer", "Luciana", "Victoria", "Carmen",
    "Gloria",  "Fernanda", "Costanza", "Louisa", "Virginia"
]

surnames = [
    "Smith", "Johnson", "Williams", "Brown", "Jones", "Garcia", "Miller", "Davis", "Rodriguez", "Martinez", "Hernandez", "Lopez", "Torres", "Nguyen", "Hill", "Flores", "Green", "Adams", "Nelson", "Baker", "Hall", "Rivera", "Campbell", "Mitchell", "Carter", "Roberts", "Gomez", "Phillips", "Evans", "Turner", "Kim", "Cox", "Ward", "Richardson", "Watson", "Brooks", "Chavez", "Wood", "James", "Bennett", "Gray", "Mendoza", "Ruiz", "Hughes", "Price", "Alvarez", "Castillo", "Sanders", "Patel", "Myers", "Long", "Ross", "Foster", "Jimenez", "Powell", "Jenkins", "Perry", "Russell", "Sullivan", "Bell", "Coleman", "Butler", "Henderson", "Barnes", "Gonzales", "Diaz", "Parker", "Cruz", "Edwards", "Collins", "Reyes", "Stewart",  "Gonzalez", "Wilson", "Anderson", "Thomas", "Taylor", "Moore", "Jackson", "Martin", 
    "Lee", "Perez", "Thompson", "White", "Harris", "Sanchez", "Clark", "Ramirez", "Lewis", "Robinson", "Walker", "Young", "Allen", "King", "Wright", "Scott",  "Gonzalez", "Wilson", "Anderson", "Thomas", "Taylor", "Moore", "Jackson", "Martin",  "Long", "Ross", "Foster", "Jimenez", "Powell", "Jenkins", "Perry", "Russell", "Sullivan", "Bell", "Coleman", "Butler", "Henderson", "Lee", "Perez", "Thompson", "White", "Harris", "Sanchez", "Butler", "Henderson", "Barnes", "Gonzales", "Fisher", "Vasquez", "Simmons", "Romero", "Jordan", "Patterson", "Alexander",  "Murray", "Ford", "Castro", "Marshall", "Owens", "Harrison", "Fernandez", "McDonald", "Woods", "Patterson", "Alexander", "Hamilton", "Graham", "Reynolds", "Griffin", "Wallace", "Moreno", "West", "Cole", "Hayes", "Bryant", "Washington", "Kennedy", "Wells", "Morris", "Morales", "Murphy", "Cook", "Rogers", "Gutierrez", "Ortiz", "Morgan", "Cooper", "Peterson", "Bailey", "Reed", "Kelly", "Howard", "Ramos", "Kim", "Cox", "Ward", "Richardson", "Watson", "Brooks", "Chavez", "Wood", "James", "Bennett", "Gray", "Mendoza", "Ruiz", "Hughes", "Price", "Alvarez", "Castillo", "Sanders", "Patel", "Myers", "Long", "Ross", "Foster", "Jimenez", "Powell", "Jenkins", "Perry", "Russell", "Sullivan", "Bell", "Coleman",  "Hamilton", "Graham", "Reynolds", "Griffin", "Wallace", "Moreno", "West", "Cole", "Hayes", "Bryant", "Herrera", "Gibson", "Ellis", "Tran", "Medina", "Aguilar", "Stevens", "Murray", "Ford", "Castro", "Marshall", "Owens", "Harrison", "Fernandez", "McDonald", "Woods", "Washington", "Kennedy", "Wells", "Vargas", "Henry", "Chen", "Freeman", "Webb", "Tucker", "Guzman", "Burns", "Crawford", "Olson", "Simpson", "Porter", "Hunter", "Gordon", "Mendez", "Silva", "Shaw", "Snyder", "Mason", "Smith", "Johnson", "Williams", "Brown", "Jones", "Garcia", "Miller", "Davis", "Rodriguez", "Martinez", "Hernandez", "Lopez", "Clark", "Ramirez", "Lewis", "Robinson", "Walker", "Young", "Allen", "King", "Wright", "Scott", "Torres", "Nguyen", "Hill", "Flores", "Green", "Adams", "Nelson", "Baker", "Hall", "Rivera", "Campbell", "Mitchell", "Carter", "Roberts", "Gomez", "Phillips", "Evans", "Turner", "Diaz", "Parker", "Cruz", "Edwards", "Collins", "Reyes", "Stewart", "Morris", "Morales", "Murphy", "Cook", "Rogers", "Gutierrez", "Ortiz", "Morgan", "Cooper", "Peterson", "Bailey", "Reed", "Kelly", "Howard", "Ramos",  "Fisher", "Vasquez", "Simmons", "Romero", "Jordan", "Patterson", "Alexander", "Hamilton", "Graham", "Reynolds", "Griffin", "Wallace", "Moreno", "West", "Cole", "Hayes", "Bryant", "Herrera", "Gibson", "Ellis", "Tran", "Medina", "Aguilar", "Stevens", "Vargas", "Henry", "Chen", "Freeman", "Webb", "Tucker", "Guzman", 
    "Burns", "Crawford", "Olson", "Simpson", "Porter", "Hunter", "Gordon", "Mendez", "Silva", "Shaw", "Snyder", "Mason", "Smith", "Johnson", "Williams", "Brown", "Jones", "Garcia", "Miller", "Davis", "Rodriguez", "Martinez", "Hernandez", "Lopez", "Gonzalez", "Wilson", "Anderson", "Thomas", "Taylor", "Moore", "Jackson", "Martin", "Lee", "Perez", "Thompson", "White", "Harris", "Sanchez", "Clark", "Ramirez", "Lewis", "Robinson", "Walker", "Young", "Allen", "King", "Wright", "Scott", "Torres", "Nguyen", "Hill", "Flores", "Green", 
    "Adams", "Nelson", "Baker", "Hall", "Rivera", "Campbell", "Mitchell", "Carter", "Roberts", "Gomez", "Phillips", "Evans", "Turner", "Diaz", "Parker", "Cruz", "Edwards", "Collins", "Reyes", "Stewart", "Morris", "Morales", "Murphy", "Cook", "Rogers", "Gutierrez", "Ortiz", "Morgan", "Cooper", "Peterson", "Bailey", "Reed", "Kelly", "Howard", "Ramos", "Kim", "Cox", "Ward", "Richardson", "Watson", "Brooks", 
    "Chavez", "Wood", "James", "Bennett", "Gray", "Mendoza", "Ruiz", "Hughes", "Price", "Alvarez", "Castillo", "Sanders", "Patel", "Myers", "Barnes", "Gonzales", "Fisher", "Vasquez", "Simmons", "Romero", "Jordan", "Herrera", "Gibson", "Ellis", "Tran", "Medina", "Aguilar", 
    "Stevens", "Murray", "Ford", "Castro", "Marshall", "Owens", "Harrison", "Fernandez", "McDonald", "Woods", "Washington", "Kennedy", "Wells", "Vargas", "Henry", "Chen", "Freeman", "Webb", "Tucker", "Guzman", "Burns", "Crawford", "Olson", "Simpson", "Porter", "Hunter", "Gordon", "Mendez", "Silva", "Shaw", "Snyder", "Mason", "Vazquez", "Ruiz", "Cortese", "Murphy", "Corinto", "Golden", "Welles"
]

gender = ['M','M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M','M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M','M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'M','M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F', 'F','F', 'F', 'F' ]

emp_df['Name'] = names
emp_df['Surname'] = surnames
emp_df['Gender'] = gender

print(len(names), len(surnames), len(gender))
print(len(emp_df))
print(gender.count('M'), gender.count('F'))
emp_df.head(10)

505 505 505
505
267 238

  emp_id     Name    Surname Birthday  Age Gender on_license hotel_id
0    NaN    James      Smith      NaN  NaN      M        NaN      NaN
1    NaN     John    Johnson      NaN  NaN      M        NaN      NaN
2    NaN   Robert   Williams      NaN  NaN      M        NaN      NaN
3    NaN  Michael      Brown      NaN  NaN      M        NaN      NaN
4    NaN  William      Jones      NaN  NaN      M        NaN      NaN
5    NaN    David     Garcia      NaN  NaN      M        NaN      NaN
6    NaN  Richard     Miller      NaN  NaN      M        NaN      NaN
7    NaN   Joseph      Davis      NaN  NaN      M        NaN      NaN
8    NaN  Charles  Rodriguez      NaN  NaN      M        NaN      NaN
9    NaN   Thomas   Martinez      NaN  NaN      M        NaN      NaN

In [4]:
# Is time to work with the columns Birthday, Age and Entry_date

# Birthday column
def random_date(start, end):
    dif_date = end - start
    random_days = random.randint(0, dif_date.days)
    random_date = start + timedelta(days=random_days)
    return random_date

start_date = datetime(1955, 1, 1)
end_date = datetime(2002, 12, 31)

random_dates = [random_date(start_date, end_date) for x in range(len(emp_df))]

rdate_lst = [date.strftime("%Y-%m-%d") for date in random_dates]

emp_df['Birthday'] = rdate_lst

<p>For this task, we are going to take the dates from the <i>Birthday column</i> and using <b>datetime.now()</b> we are going to calculate the Age of our employees Then add the values to the database in the column <i>"Age"</i>.</p>

In [5]:
# For the age column I will calculate from todays date
# Let's convert the data from the 'Birthday' column into datetime
emp_df['Birthday'] = pd.to_datetime(emp_df['Birthday'])

# Let's take todays date to calculate the ages
today = datetime.now()

# Now let's calculate our employees age and put the values in the columns
emp_df['Age'] = today.year - emp_df['Birthday'].dt.year - ((today.month < emp_df['Birthday'].dt.month) | ((today.month == emp_df['Birthday'].dt.month) & (today.day < emp_df['Birthday'].dt.day)))

emp_df.head()

  emp_id     Name   Surname   Birthday  Age Gender on_license hotel_id
0    NaN    James     Smith 1957-08-09   67      M        NaN      NaN
1    NaN     John   Johnson 1981-11-19   42      M        NaN      NaN
2    NaN   Robert  Williams 1983-10-15   41      M        NaN      NaN
3    NaN  Michael     Brown 1976-04-05   48      M        NaN      NaN
4    NaN  William     Jones 1968-11-20   55      M        NaN      NaN

<p>Now it's time to add the values to the <i>on_license column</i>. For this task instead of using the values <i>True o False</i>, i will replace them with the values <i>0 for <b>False</b></i> and <i>1 for <b>True</b></i>.</p>

In [6]:
on_license_zero = list(np.random.randint(0, 1, size=432))
on_license_one = list(np.random.randint(1, 2, size=73))

total_license = on_license_zero + on_license_one
random.shuffle(total_license)

emp_df['on_license'] = total_license
emp_df.head()

  emp_id     Name   Surname   Birthday  Age Gender  on_license hotel_id
0    NaN    James     Smith 1957-08-09   67      M           0      NaN
1    NaN     John   Johnson 1981-11-19   42      M           0      NaN
2    NaN   Robert  Williams 1983-10-15   41      M           0      NaN
3    NaN  Michael     Brown 1976-04-05   48      M           0      NaN
4    NaN  William     Jones 1968-11-20   55      M           0      NaN

<p>Our last task is to create the <b>ID</b> for each of our employees. It will consist in a combination of four numbers.</p>

In [7]:
rand_id = list(np.random.randint(0, 9999, size=len(emp_df)))

emp_df['emp_id'] = rand_id

emp_df.head()

   emp_id     Name   Surname   Birthday  Age Gender  on_license hotel_id
0    3272    James     Smith 1957-08-09   67      M           0      NaN
1    3073     John   Johnson 1981-11-19   42      M           0      NaN
2    6627   Robert  Williams 1983-10-15   41      M           0      NaN
3     420  Michael     Brown 1976-04-05   48      M           0      NaN
4    4856  William     Jones 1968-11-20   55      M           0      NaN

<p>Let's check if we have null or missing values in our database. Remember the hotel id will be added later.</p>

In [8]:
missing_values = emp_df.isnull().sum()
print('The total missing values are: ', missing_values)

The total missing values are:  emp_id          0
Name            0
Surname         0
Birthday        0
Age             0
Gender          0
on_license      0
hotel_id      505
dtype: int64

In [9]:
# Hotel's database
hotel_schema = {'hotel_id':'str', 'Name':'str', 'Location':'str', 'Opening':'object', 'Stars':'int64', 'Budget':'float64'}
hotel_df = pd.DataFrame(columns=hotel_schema.keys()).astype(hotel_schema)

print(hotel_df)
hotel_df.dtypes

Empty DataFrame
Columns: [hotel_id, Name, Location, Opening, Stars, Budget]
Index: []

hotel_id     object
Name         object
Location     object
Opening      object
Stars         int64
Budget      float64
dtype: object

<p>Now, let's start working with the Hotel's database. This database will contain the data of three hotels, where the employees are distributed.</p>

<p>Because the data is not so big, for this occasion I will use a dictionary.</p>

In [10]:
hotel_data = [
    {
        'hotel_id':'FUESSP',
        'Name':'Sandy Shores Park',
        'Location':'28 03 18.9N-14 19 21.4W',
        'Opening':'2001-03-05',
        'Stars': 4,
        'Budget': 350000000.00
    },
    {
        'hotel_id':'TFNOBH',
        'Name':'Ocean Breeze Haven',
        'Location':'28 05 56.5N-16 44 54.6W',
        'Opening':'1998-10-05',
        'Stars': 5,
        'Budget': 550000000.00
    },
    {
        'hotel_id':'ACECWR',
        'Name':'Coral Wave Resort',
        'Location':'28 51 25.9N-13 47 48.7 W',
        'Opening':'2000-05-05',
        'Stars': 5,
        'Budget': 480000000.00
    }
]

hotel_df = pd.DataFrame(hotel_data)

hotel_df.head()

,hotel_id,Name,Location,Opening,Stars,Budget
0,FUESSP,Sandy Shores Park,28 03 18.9N-14 19 21.4W,2001-03-05,4,350000000.0
1,TFNOBH,Ocean Breeze Haven,28 05 56.5N-16 44 54.6W,1998-10-05,5,550000000.0
2,ACECWR,Coral Wave Resort,28 51 25.9N-13 47 48.7 W,2000-05-05,5,480000000.0

In [11]:
# Let's create the data to put into the employees column
ids = []
count = 0
while count < 505:
    if count >= 340:
        ids.append('ACECWR')
    elif count <= 165:
        ids.append('FUESSP')
    else:
        ids.append('TFNOBH')
    count += 1
        
print(ids.count('FUESSP'), ids.count('TFNOBH'), ids.count('ACECWR'))

emp_df['hotel_id'] = ids

emp_df.head()

166 174 165

   emp_id     Name   Surname   Birthday  Age Gender  on_license hotel_id
0    3272    James     Smith 1957-08-09   67      M           0   FUESSP
1    3073     John   Johnson 1981-11-19   42      M           0   FUESSP
2    6627   Robert  Williams 1983-10-15   41      M           0   FUESSP
3     420  Michael     Brown 1976-04-05   48      M           0   FUESSP
4    4856  William     Jones 1968-11-20   55      M           0   FUESSP

In [12]:
missing_values = emp_df.isnull().sum()
print('The total missing values are: ', missing_values)

The total missing values are:  emp_id        0
Name          0
Surname       0
Birthday      0
Age           0
Gender        0
on_license    0
hotel_id      0
dtype: int64

In [13]:
# Hotel's Composition
hcomp_schema = {'hc_id':'str', 'Department':'str', 'Active_employees':'int64', 'Emp_with_license':'int64', 'Total_employees':'int64'}
hcomp_df = pd.DataFrame(columns=hcomp_schema.keys()).astype(hcomp_schema)

print(hcomp_df)
hcomp_df.dtypes

Empty DataFrame
Columns: [hc_id, Department, Active_employees, Emp_with_license, Total_employees]
Index: []

hc_id               object
Department          object
Active_employees     int64
Emp_with_license     int64
Total_employees      int64
dtype: object

In [14]:
emp_lic_count = emp_df.groupby('hotel_id')['on_license'].value_counts()
print(emp_lic_count)

hotel_id  on_license
ACECWR    0             137
          1              28
FUESSP    0             148
          1              18
TFNOBH    0             147
          1              27
Name: on_license, dtype: int64

In [15]:
# Workforce Composition
wfc_schema = {'wkc_id':'str', 'Department':'str', 'Position':'str', 'years_at_position':'int64', 'Entry_date':'object', 'years_working':'int64', 'Staff':'int64', 'emp_id':'str', 'hotel_id':'str'}
wfc_df = pd.DataFrame(columns=wfc_schema.keys()).astype(wfc_schema)

print(wfc_df)
wfc_df.dtypes

Empty DataFrame
Columns: [wkc_id, Department, Position, years_at_position, Entry_date, years_working, Staff, emp_id, hotel_id]
Index: []

wkc_id               object
Department           object
Position             object
years_at_position     int64
Entry_date           object
years_working         int64
Staff                 int64
emp_id               object
hotel_id             object
dtype: object

In [16]:
wfc_df['emp_id'] = emp_df['emp_id']
wfc_df['hotel_id'] =emp_df['hotel_id']

wfc_df.head()

,wkc_id,Department,Position,years_at_position,Entry_date,years_working,Staff,emp_id,hotel_id
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3272,FUESSP
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3073,FUESSP
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6627,FUESSP
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,420,FUESSP
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4856,FUESSP

In [17]:
wfc_df['wkc_id'] = wfc_df['emp_id'].astype(str) + wfc_df['hotel_id']

wfc_df.head()

,wkc_id,Department,Position,years_at_position,Entry_date,years_working,Staff,emp_id,hotel_id
0,3272FUESSP,NaN,NaN,NaN,NaN,NaN,NaN,3272,FUESSP
1,3073FUESSP,NaN,NaN,NaN,NaN,NaN,NaN,3073,FUESSP
2,6627FUESSP,NaN,NaN,NaN,NaN,NaN,NaN,6627,FUESSP
3,420FUESSP,NaN,NaN,NaN,NaN,NaN,NaN,420,FUESSP
4,4856FUESSP,NaN,NaN,NaN,NaN,NaN,NaN,4856,FUESSP

In [18]:
hotel_start_dates = {
    'FUESSP': datetime(2001, 3, 5),
    'TFNOBH': datetime(1998, 10, 5),
    'ACECWR': datetime(2000, 5, 5)
}

def random_entry_date(start):
    end= datetime(2024, 10, 31)
    dif_date = end - start
    random_days = random.randint(0, dif_date.days)
    random_date = start + timedelta(days=random_days)
    return random_date
      

random_entry_dates = wfc_df['hotel_id'].apply(lambda x: random_entry_date(hotel_start_dates.get(x)) if x in hotel_start_dates else None)

entry_date_lst = [date.strftime("%Y-%m-%d") for date in random_entry_dates]

wfc_df['Entry_date'] = entry_date_lst
wfc_df.head()

,wkc_id,Department,Position,years_at_position,Entry_date,years_working,Staff,emp_id,hotel_id
0,3272FUESSP,NaN,NaN,NaN,2023-09-26,NaN,NaN,3272,FUESSP
1,3073FUESSP,NaN,NaN,NaN,2023-04-29,NaN,NaN,3073,FUESSP
2,6627FUESSP,NaN,NaN,NaN,2014-01-17,NaN,NaN,6627,FUESSP
3,420FUESSP,NaN,NaN,NaN,2012-10-25,NaN,NaN,420,FUESSP
4,4856FUESSP,NaN,NaN,NaN,2023-06-18,NaN,NaN,4856,FUESSP

In [19]:
# For the years_working column I will calculate from todays date
# Let's convert the data from the 'Entry_date' column into datetime
wfc_df['Entry_date'] = pd.to_datetime(wfc_df['Entry_date'])

# Let's take todays date to calculate the ages
# today1 = datetime.now()

# Now let's calculate our employees age and put the values in the columns
wfc_df['years_working'] = today.year -wfc_df['Entry_date'].dt.year - ((today.month < wfc_df['Entry_date'].dt.month) | ((today.month == wfc_df['Entry_date'].dt.month) & (today.day < wfc_df['Entry_date'].dt.day)))

wfc_df.head()

,wkc_id,Department,Position,years_at_position,Entry_date,years_working,Staff,emp_id,hotel_id
0,3272FUESSP,NaN,NaN,NaN,2023-09-26,1,NaN,3272,FUESSP
1,3073FUESSP,NaN,NaN,NaN,2023-04-29,1,NaN,3073,FUESSP
2,6627FUESSP,NaN,NaN,NaN,2014-01-17,10,NaN,6627,FUESSP
3,420FUESSP,NaN,NaN,NaN,2012-10-25,12,NaN,420,FUESSP
4,4856FUESSP,NaN,NaN,NaN,2023-06-18,1,NaN,4856,FUESSP

In [20]:
departments = ['Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', '3R', '3R', '3R', '3R', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', '3R', '3R', '3R', '3R', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Reception_Reservations', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Floors_Laundry', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Kitchen', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Bar_Restaurant', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Animation', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'Technical_Services', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', 'SPA', '3R', '3R', '3R', 'Other', 'Other', 'Other', 'Other', 'Other', 'Other']

wfc_df['Department'] = departments
wfc_df.head()

,wkc_id,Department,Position,years_at_position,Entry_date,years_working,Staff,emp_id,hotel_id
0,3272FUESSP,Reception_Reservations,NaN,NaN,2023-09-26,1,NaN,3272,FUESSP
1,3073FUESSP,Reception_Reservations,NaN,NaN,2023-04-29,1,NaN,3073,FUESSP
2,6627FUESSP,Reception_Reservations,NaN,NaN,2014-01-17,10,NaN,6627,FUESSP
3,420FUESSP,Reception_Reservations,NaN,NaN,2012-10-25,12,NaN,420,FUESSP
4,4856FUESSP,Reception_Reservations,NaN,NaN,2023-06-18,1,NaN,4856,FUESSP

In [21]:
# Employee's Wage database
emp_wages_schema = {'emp_wag_id':'str', 'Price_$_Hour':'float64', 'Hours_worked':'float64', 'Work_overtime':'float64', 'Ovh$_75%':'float64', 'Gross_pay':'float64', 'Deductions_3%':'float64', 'Total_Payment':'float64','emp_id':'str', 'hotel_id':'str'}
emp_wages_df = pd.DataFrame(columns=emp_wages_schema.keys()).astype(emp_wages_schema)

print(emp_wages_df)
emp_wages_df.dtypes

Empty DataFrame
Columns: [emp_wag_id, Price_$_Hour, Hours_worked, Work_overtime, Ovh$_75%, Gross_pay, Deductions_3%, Total_Payment, emp_id, hotel_id]
Index: []

emp_wag_id        object
Price_$_Hour     float64
Hours_worked     float64
Work_overtime    float64
Ovh$_75%         float64
Gross_pay        float64
Deductions_3%    float64
Total_Payment    float64
emp_id            object
hotel_id          object
dtype: object

In [22]:
def extract_letters(x):
    return x[:2].upper()

extract_department = wfc_df['Department'].apply(extract_letters)
# print(extract_department)

emp_wages_df['emp_id'] = wfc_df['emp_id']
emp_wages_df['hotel_id'] = wfc_df['hotel_id']
emp_wages_df['emp_wag_id'] = wfc_df['emp_id'].astype(str) + extract_department + wfc_df['hotel_id']

emp_wages_df.head()

,emp_wag_id,Price_$_Hour,Hours_worked,Work_overtime,Ovh$_75%,Gross_pay,Deductions_3%,Total_Payment,emp_id,hotel_id
0,3272REFUESSP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3272,FUESSP
1,3073REFUESSP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3073,FUESSP
2,6627REFUESSP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6627,FUESSP
3,420REFUESSP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,420,FUESSP
4,4856REFUESSP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4856,FUESSP

In [23]:
hour_price_rand = list(np.random.randint(12, 26, size=len(emp_wages_df)))
hworked = list(np.random.randint(120, 161, size=len(emp_wages_df)))
overtime = list(np.random.randint(0, 12, size=len(emp_wages_df)))

emp_wages_df['Price_$_Hour'] = hour_price_rand
emp_wages_df['Hours_worked'] = hworked
emp_wages_df['Work_overtime'] = overtime

emp_wages_df['Ovh$_75%'] = emp_wages_df['Price_$_Hour'] * 0.75

emp_wages_df['Gross_pay'] = (emp_wages_df['Price_$_Hour'] * emp_wages_df['Hours_worked']) + (emp_wages_df['Work_overtime'] * emp_wages_df['Ovh$_75%'])

emp_wages_df['Deductions_3%'] = emp_wages_df['Gross_pay'] * 0.03

emp_wages_df['Total_Payment'] = emp_wages_df['Gross_pay'] - emp_wages_df['Deductions_3%']

emp_wages_df.head()

,emp_wag_id,Price_$_Hour,Hours_worked,Work_overtime,Ovh$_75%,Gross_pay,Deductions_3%,Total_Payment,emp_id,hotel_id
0,3272REFUESSP,19,129,4,14.25,2508.00,75.2400,2432.7600,3272,FUESSP
1,3073REFUESSP,18,143,3,13.50,2614.50,78.4350,2536.0650,3073,FUESSP
2,6627REFUESSP,14,135,4,10.50,1932.00,57.9600,1874.0400,6627,FUESSP
3,420REFUESSP,19,121,11,14.25,2455.75,73.6725,2382.0775,420,FUESSP
4,4856REFUESSP,17,132,7,12.75,2333.25,69.9975,2263.2525,4856,FUESSP

In [24]:
with pd.ExcelWriter('hotel_hranalytics.xlsx') as writer:
    emp_df.to_excel(writer, sheet_name='Employees', index=False)
    hotel_df.to_excel(writer, sheet_name='Hotels', index=False)
    hcomp_df.to_excel(writer, sheet_name='Hotel_Composition', index=False)
    wfc_df.to_excel(writer, sheet_name='Workforce_Composition', index=False)
    emp_wages_df.to_excel(writer, sheet_name='Employees_wages', index=False)